{-28.6. Да се дефинира функция separate :: (a->Bool) -> [a] -> ([a],[a]),
която по предикат p и списък l връща двойката (pref,suf). pref е най-
дългият възможен префикс, такъв че всички негови елементи увовлет-
воряват p. suf е останалата част от списъка l. Например, separate even
[2,4,6,7,8,10] -> ([2,4,6],[7,8,10]). Забележка: вижте функция-
та break в Prelude.
-}

separate :: (a -> Bool) -> [a] -> ([a],[a])
separate p l = (takeWhile p l, dropWhile p l)

primer :: [Integer]
primer = [2,4,6,7,8,10]
