{-29.4. Да се дефинира функция caseof :: [(a->Bool,a->b)] -> (a -> b). Фун-
кцията приема k на брой двойки (pi, fi), където pi е предикат над a, а
fi е функция a → b. Функцията caseof връща функция, която приема
аргумент x от тип a и връща стойността fi(x) на първата функция в спи-
съка, за която предикатът pi(x) е изпълнен. Ако няма такъв предикат,
да се връща стойността на последната функция в списъка. Например,
функцията myf, дефинирана така:
myf = caseof [( even , \ x −> x+1) , (odd , \x −> x−1)]
ще увеличава с единица четните числа и ще намалява с единица нечет-
ните числа.
-}

caseof :: [(a -> Bool,a -> b)] -> (a -> b)
caseof [] = \_ -> error "no matching predicate!"
caseof ((p,f): xs) = \x -> if p x then f x else caseof xs x

f :: Integer -> Integer
f = caseof [(even,\x -> x + 1),(odd,\x -> x - 1)]

g :: a -> b
g = caseof []